RIET/src/Catalogs/CustomsCards/CustomsCards.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CustomsCards</name>
  <attributes>
    <name>CardHolder</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CCA</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>ExpiryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ParentCompany</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </attributes>
  <attributes>
    <name>DefaultCustoms</name>
    <type>
      <types>CatalogRef.Customs</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Catalogs/CustomsCards/ObjectModule.bsl
//////////////////////////////////////////////////////////////////////
// ПРИ КОПИРОВАНИИ

Процедура ПриКопировании(ОбъектКопирования)
	
	РГСофт.ОчиститьCreationModification(ЭтотОбъект);
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////////
// ПЕРЕД ЗАПИСЬЮ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	ДозаполнитьРеквизитыБезДополнительныхДанных();
	
	ПроверитьРеквизитыБезДополнительныхДанных(Отказ);
		
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////////

Процедура ДозаполнитьРеквизитыБезДополнительныхДанных()
	
	Код = СокрЛП(Код);
	CardHolder = СокрЛП(CardHolder);
	
	Если ЭтоНовый() Тогда
		РГСофт.ЗаполнитьCreation(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры 


///////////////////////////////////////////////////////////////////////////////////////

Процедура ПроверитьРеквизитыБезДополнительныхДанных(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СокрЛП(Код)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'No.' is empty!",
			ЭтотОбъект, "Код", , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(CardHolder) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Card holder' is empty!",
			ЭтотОбъект, "CardHolder", , Отказ);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(CCA) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'CCA' is empty!",
			ЭтотОбъект, "CCA", , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ExpiryDate) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Expiry date' is empty!",
			ЭтотОбъект, "ExpiryDate", , Отказ);	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ParentCompany) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Parent company' is empty!",
			ЭтотОбъект, "ParentCompany", , Отказ);	
	КонецЕсли;

КонецПроцедуры
